app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.new(class_params)
        @school_class.save
---
INSERT INTO "school_classes" DEFAULT VALUES

    def find_class
        SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]